Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: །རྒས་པ་དང་རྒ་བའི་ཟིལ་གྱིས་ནོན་པ་རྣམས་ལ་ནི་བསྙེན་བཀུར་བ་དང་། རིམ་གྲོ་དང་། ཡོ་བྱད་ཀྱིས་མི་ཕོངས་པར་ཡོངས་སུ་བསྡུད་པ་བྱེད་དོ།
en: I serve and attend those who are old, who are overpowered by old age. I collect the necessities for life for those who are without them.

source: །མགོན་མེད་པའི་སེམས་ཅན་རྣམས་ལ་མགོན་བྱེད་དོ།
en: I am a protector for beings who have no protector.

source: །ཕོངས་ཤིང་དབུལ་བ་རྣམས་ལ་ནི་ནོར་དང་། གསེར་གྱི་ཕུང་པོས་ཡོངས་སུ་སྡུད་དོ། །ལོག་པར་ལྟུང་བ་རྣམས་ནི་དོན་འཐུན་པས་ཡོངས་སུ་སྡུད་དོ།
en: I gather a mass of wealth and gold for those who are destitute and poor. I gather what is needed for those who are ruined.

source: །ཡུལ་གཞན་དུ་ཕྱིན་པ་རྣམས་ནི། རང་གི་ཡུལ་དུ་ཕྱིན་པར་བྱེད་དོ།
en: I lead those who have gone astray in other lands back to their homelands.

source: །ཕྱོགས་ལོག་པར་ཞུགས་པ་རྣམས་ནི། ཕྱོགས་མ་ནོར་བར་འཛུད་དོ།
en: I take into the correct direction those who follow the wrong direction.

source: །བརྩོན་ར་ན་འདུག་པ་རྣམས་ནི་བརྩོན་ར་ནས་ཐར་བར་བྱེད་དོ།
en: I free from prison those who are in prison.

source: །ཆད་པས་གཅད་པ་ནི་ཆད་པའི་སྡུག་བསྔལ་ལས་གྲོལ་བར་བྱེད་དོ། །ཉེས་པ་བྱུང་སྟེ།
en: I free from the suffering of punishment those who are being punished.

source: རྒྱལ་པོས་གསད་པར་བཀྲི་བ་རྣམས་ནི་སྲོག་གི་དབུགས་ཕྱིན་པ་ཐོབ་པར་བྱེད་དོ།
en: I save the lives of those who are criminals being led to execution. “In my mind there arises this thought:

source: །སེམས་ཀྱང་བདག་ཇི་ལྟར་སེམས་ཅན་འདི་དག་འཇིགས་པ་དང་། གནོད་པ་སྣ་ཚོགས་ལས་ཡོངས་སུ་སྐྱོབ་ཅིང་།
en: ‘May I protect and save these beings from these various kinds of fear and harm.

source: མགོན་བྱེད་པ་དེ་བཞིན་དུ་བདག་གིས་འདི་རྣམས་བླ་ན་མེད་པའི་ཆོས་ཀྱི་ཡོངས་སུ་བསྡུ་བས་ཡོངས་སུ་བསྡུས་ཏེ། ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ།
en: Similarly, may I free them from all the kleśas through gathering a collection of the highest Dharmas.

source: །སྐྱེ་བ་དང་རྒ་བ་དང་ན་བ་དང་། འཆི་བ་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡང་དག་པར་བཟླ་བར་བྱའོ།
en: May I cause them to transcend birth, aging, illness, death, misery, wailing, suffering, unhappiness, and torment.

source: །ངན་སོང་དང་ལོག་པར་ལྟུང་བའི་འཇིགས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ།
en: May I liberate them from all fear of falling into the lower realms.

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་གཟུངས་ལ་རབ་ཏུ་དགོད་པར་བྱའོ།
en: May I bring them into the care of kalyāṇamitras.

source: །ཆོས་རིན་པོ་ཆེ་སྦྱིན་པའི་ཡོངས་སུ་བསྡུ་བས་ཡོངས་སུ་བསྡུ་བར་བྱའོ།
en: May I gather a collection of the gift of the precious Dharma.

source: །ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ལ་རབ་ཏུ་དགོད་པར་བྱའོ།
en: May I establish them in nontransgressive conduct.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམ་པར་དག་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱའོ།
en: May I inspire them toward the pure body of the tathāgatas.

source: །རྒ་ཤི་ཡོངས་སུ་མེད་པའི་དབྱིངས་ཤིན་ཏུ་རྟོགས་པ་ལ་རབ་ཏུ་དགོད་པར་བྱ་བར་བསྐྱེད་དོ།
en: May I establish them in the realization of the essence that is completely free of aging and death.’

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་ཅན་ལོག་པའི་ལམ་ལ་ཞུགས་པ།
en: “Noble one, through various methods I become the protector of those beings who follow wrong paths;

source: ལྟ་བའི་རྣམ་པ་ཐིབས་པོ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པ།
en: who are attached to various dark views;

source: ལོག་པར་ལྟ་བའི་སྤྱོད་ཡུལ་ཅན་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཉམ་ང་བར་འགྱུར་བ་ལ་ཡོངས་སུ་སྤྱོད་པ།
en: who have the range of activity of incorrect concepts; who engage in dreadful physical, vocal, and mental conduct;

source: བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་སྣ་ཚོགས་ལ་གནས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་ཡིན་ཡང་།
en: who follow various kinds of discipline and asceticism;

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འདུ་ཤེས་པ།
en: who view that which is not complete buddhahood as complete buddhahood;

source: ལུས་གདུང་བ་དང་། ཡོངས་སུ་གདུང་བ་ལ་རབ་ཏུ་བརྩོན་པ།
en: who are engaged in paining and tormenting their bodies;

source: མཚོ་དང་། མཚེའུ་དང་། ལུ་མ་དང་། རྫིང་བུ་དང་། ཆུ་ཀླུང་དང་། རིའི་གཟར་དང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་ལ་འདུད་ཅིང་ཕྱག་འཚལ་བ་མོས་པ།
en: who bow down to, pay homage to, and place their trust in lakes, ponds, springs, reservoirs, rivers, precipitous mountains, the directions, and the intermediate directions;

source: སྡིག་པའི་གྲོགས་པོའི་དབང་དུ་གྱུར་བརྣམས་ལ་ཡང་ཐབས་སྣ་ཚོགས་ཀྱིས་མགོན་དུ་གྱུར་པར་བྱེད་དེ།
en: and who are under the power of bad companions.

source: དེ་དག་སྡིག་པའི་ལྟ་བའི་རྣམ་པ་དང་། ངན་སོང་ཐམས་ཅད་ཀྱི་གཡང་སར་ལྟུང་བའི་ལམ་ལས་རྣམ་པར་བཟློག་གོ །འཇིག་རྟེན་པའི་ཡང་དག་པའི་ལྟ་བ་ལ་རབ་ཏུ་བཀོད་ཅིང་།
en: “I turn them away from evil views and all paths that lead to falling into the abyss of the lower realms. I establish them in the correct worldly view.

source: ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ལའང་ཡོངས་སུ་འགོད་དོ།
en: I establish them in the good fortune of humans and devas. “In my mind there arises this thought:

source: །སེམས་ཀྱང་ཇི་ལྟར་བདག་གིས་སེམས་ཅན་འདི་དག་ཉམ་ང་བའི་ནན་ཏན་དང་། སྡུག་བསྔལ་ལས་ཡོངས་སུ་བཀྲོལ་བ་དེ་བཞིན་དུ་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱང་།
en: ‘May I liberate these beings from dreadful practices and suffering.

source: འཕགས་པ་འཇིག་རྟེན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ལ་བཀོད་དེ།
en: Similarly, may I establish all beings in the noble, transcendent path of the perfections.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་བྱས་ལ་ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་ཆེན་པོས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དགོད་པར་བྱའོ།
en: May I cause them to progress irreversibly toward omniscience and through completely good great prayer bring them to omniscience.

source: །སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་མ་དུལ་གྱི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལས་ཀྱང་མི་གཡོ་བར་བྱ་བར་བསྐྱེད་དོ།
en: And may I never depart from the level of a bodhisattva until all realms of beings have been guided.’

source: །དེ་ནས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པས་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཕྱོགས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་འདི་བརྣན་ཏེ། བསྟན་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །གཏི་མུག་མ་རིག་མུན་ནག་བསྩལ་དོན་དུ།
en: At that time, Vāsantī, the goddess of the night, in order to teach further the bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings , through the blessing of the buddhas looked into the ten directions and then recited these verses to Sudhana, the head merchant’s son:

source: །སེམས་ཅན་ཕན་ཕྱིར་ཁོ་མོ་ཆོས་བསྟན་ཏེ།
en: “I teach the Dharma so as to benefit beings, In order to dispel the darkness of ignorance and stupidity.

source: །དུས་ལ་བསྡད་ཅིང་འགྲོ་བ་བདེ་བར་བྱས།
en: I observe the time and bring happiness to beings.

source: །འདི་ནི་རྣམ་ཐར་ཚུལ་མཆོག་ཞི་བ་ཡིན།
en: This is my supreme way of liberation, of peace.

source: །ཁོ་མོས་བྱམས་ཡངས་ཤིན་ཏུ་སྤྱད་པ་བྱས།
en: “I have perfectly practiced vast love,

source: །བསྐལ་པ་མཐའ་ཡས་སྔོན་ཅད་ཤིན་ཏུ་བསྒོམས།
en: Meditating throughout limitless kalpas in the past.

source: །དེས་ནི་འཇིག་རྟེན་རྒྱས་བཀང་སྣང་བར་བྱས།
en: In that way, I have filled the world with illumination.

source: །ནོར་བཟངས་བརྟན་པས་ཚུལ་འདི་ཤེས་པར་གྱིས།
en: Sudhana, know this way well.

source: །ཁོ་མོའི་སྙིང་རྗེ་རྒྱ་མཚོ་ཚད་མེད་དེ།
en: “My ocean of compassion is measureless.

source: །འདི་ལས་དུས་གསུམ་རྒྱལ་བ་འཇིག་རྟེན་འབྱུང་།
en: Through it the jinas of the three times appear in the world.

source: །དེས་ནི་འགྲོ་བའི་སྡུག་བསྔལ་ཞི་བར་བྱེད།
en: Through it the suffering of beings is quelled.

source: འཇིག་རྟེན་བདེ་བ་མངོན་པར་བསྒྲུབ་པ་དང་། །མ་བྱས་འཕགས་པའི་བདེ་བ་མངོན་བསྒྲུབ་ཅིང་།
en: “Creating worldly happiness And noncomposite, higher bliss

source: །དེས་ནི་ཁོ་མོ་དགའ་མགུ་རངས་པར་བྱེད།
en: Pleases, delights, and gladdens me.

source: །རྒྱལ་སྲས་ཁྱོད་ཀྱིས་ཚུལ་འདི་ཤེས་བར་གྱིས། །སངས་རྒྱས་སྟོབས་རྣམས་ཡོངས་སུ་སྦྱོང་བྱེད་ཅིང་།
en: Jinaputra, understand this way of mine.

source: །ཉན་ཐོས་ཡེ་ཤེས་རྣམ་ཐར་འབྲས་བུ་དང་། །འདུས་བྱས་སྐྱོན་ལས་རྟག་ཏུ་ཕྱིར་ཕྱོགས་ཀྱིས།
en: “Always turned away from composite faults And the wisdom, liberation, and results of the śrāvakas, I purify the strengths of the buddhas.

source: །རྒྱལ་སྲས་ཁྱོད་ཀྱིས་ཚུལ་འདི་ཤེས་པར་གྱིས།
en: Jinaputra, understand this way of mine.

source: །ཁོ་མོའི་མིག་ནི་རྒྱ་ཆེ་ཡོངས་སུ་དག དེས་ནི་ཕྱོགས་བཅུའི་ཞིང་རྣམས་མང་པོ་མཐོང་།
en: “My eyesight is vast and completely pure. With it I see many realms in the ten directions.

source: །ཞིང་དབྱིངས་དེ་དག་ཀུན་གྱི་རང་བྱུང་རྣམས།
en: I see the self-originated ones in those realms

source: །བྱང་ཆུབ་ཤིང་དབང་དྲུང་ན་བཞུགས་པ་མཐོང་།
en: Seated under the lords of Bodhi trees. “I see the buddhas and their assemblies,

source: །སངས་རྒྱས་སྐུ་ནི་མཚན་གྱིས་ཡོངས་བརྒྱན་ཅིང་།
en: The buddhas’ bodies beautified by signs,

source: །འོད་བཟང་རྣམ་པ་སྣ་ཚོགས་ཀུན་འགྱེད་དེ།
en: Emanating multicolored beautiful light rays,

source: །བ་སྤུ་ཀུན་ནས་འོད་གཟེར་མང་འགྱེད་པའི། །སངས་རྒྱས་འཁོར་དང་བཅས་པ་ཁོ་མོས་མཐོང་།
en: A multitude of light rays emanating from all their pores.

source: །ཞིང་དབྱིངས་དེ་དག་ཀུན་གྱི་སེམས་ཅན་རྣམས།
en: “I see the beings within those realms

source: །ཤི་འཕོ་སྐྱེ་བའི་སྒོར་ཡང་ཀུན་མཐོང་སྟེ།
en: And their entrances into death and rebirth,

source: །བྱིས་པ་དེ་དག་འགྲོ་རྒྱུད་རྒྱ་མཚོ་ན།
en: Those foolish ones who in those oceans of existences

source: །འཁོར་ཞིང་རང་རང་ལས་ཀྱང་མྱོང་པར་བྱེད།
en: Continue in saṃsāra and experience the results of their actions.

source: །ཁོ་མོའི་རྣ་བ་རྒྱ་མཚོ་རྣམ་དག་སྟེ།
en: “Completely pure is the ocean of my hearing

source: །དེར་ནི་སྒྲ་རྣམས་མ་ལུས་ཡོངས་སུ་འདུ།
en: In which are gathered all sounds without exception.

source: །འགྲོ་བ་ཀུན་ཀྱི་སྒྲ་སྐད་རྒྱ་མཚོ་དག །ཀུན་ཀྱང་ཐོས་ནས་དྲན་པས་ཡོངས་སུ་འཛིན།
en: I hear and hold in my memory The entire ocean of the languages in all worlds. “The speech beyond analogy or equal,

source: །དབྱངས་ཀྱི་ཡན་ལག་སྒྲ་སྐད་ཐམས་ཅད་ཀྱིས། །དཔེ་ཟླ་མེད་པའི་གསུང་ནི་རབ་བརྒྱན་ཏེ།
en: Adorned by all aspects of speech and all sounds,

source: །དེས་ནི་རྒྱལ་བ་འཁོར་ལོ་རབ་ཏུ་བསྐོར།
en: The wheel that is turned by the jinas

source: །དེ་དག་ཁོ་མོས་ཐོས་ཤིང་དྲན་པས་འཛིན།
en: I hear and hold in my memory.

source: །ཁོ་མོའི་སྣ་ཡི་མཐུ་ཡང་རྣམ་དག་སྟེ།
en: “My power of smell also is completely pure. Jinaputra, understand this way that is The entrance to dwelling in all liberations,

source: །ཆོས་ཚུལ་རྒྱ་མཚོ་དག་ལ་ཐོགས་པ་མེད། །རྣམ་ཐར་གནས་རྣམས་ཀུན་ཏུ་རབ་འཇུག་པའི། །ཚུལ་འདི་རྒྱལ་སྲས་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས།
en: Without impediment, in the ocean of the ways of the Dharma.

source: །ཁོ་མོའི་ལྕེ་ནི་རྒྱ་ཆེ་རབ་ཏུ་ཡངས།
en: “My tongue is vast and extensive,

source: །སྲབ་ཅིང་མདོག་དམར་རིན་ཆེན་འོད་དུ་དག །སེམས་ཅན་བསམ་པ་ཇི་བཞིན་དེ་ཤེས་བྱེད།
en: Subtle, red, and shining like a jewel.

source: །ཁོ་མོའི་ཆོས་ལུས་ཤིན་ཏུ་རྣམ་དག་སྟེ།
en: “My Dharma body is completely pure.

source: །དུས་གསུམ་ཀུན་ཏུ་འོད་གསལ་རབ་ཏུ་གནས།
en: I remain in its brilliance throughout the three times,

source: །གཟུགས་ལུས་སེམས་ཅན་བསམ་པ་ཇི་བཞིན་ཏེ།
en: In a form of body in accordance with the wishes of beings,

source: །དེ་དག་ཀུན་གྱི་དད་པའི་དབང་དུ་མཐོང་།
en: Which they all see through the power of their faith.

source: །ཁོ་མོའི་སེམས་ནི་ཆགས་མེད་ཟག་པ་མེད།
en: “My mind is without attachment, undefiled.

source: །སྒྲ་དབྱངས་སྤྲིན་གྱི་ང་རོ་ཇི་བཞིན་ཏེ།
en: The sound of speech is like the roaring of the clouds.

source: །དེ་ཡི་ཁོངས་སུ་མི་མཆོག་ཀུན་ཆུད་ཀྱང་།
en: Though all lords of humans are contained in it,

source: །དེ་ལ་ཁོ་མོ་རྣམ་པར་རྟོག་པ་མེད། །ཞིང་གི་དབྱིངས་ཀྱི་སེམས་ཅན་བསམ་མི་ཁྱབ།
en: I have no conceptualization concerning that.

source: །དེ་དག་སེམས་ཀྱི་རྒྱ་མཚོ་ཁོ་མོས་ཤེས།
en: “I know the ocean of the minds Of the countless beings in the realms.

source: །དེ་དག་དབང་པོ་བསམ་པ་རབ་ཤེས་ཀྱང་།
en: I know their faculties and aspirations,

source: །དེ་ལ་ཁོ་མོ་རྣམ་པར་རྟོག་པ་མེད།
en: But in this I have no conceptualization.

source: །ཁོ་མོའི་རྫུ་འཕྲུལ་རབ་ཡངས་ཤིན་ཏུ་གྲུབ།
en: “My miracles are vast and perfectly performed.

source: །དེས་ནི་བསམ་ཡས་ཞིང་ཡང་རབ་ཏུ་བསྐྱོད།
en: They are inconceivable and shake the realms.

source: །ལུས་ཀྱི་འོད་དང་མཐུ་ཡང་དེ་བཞིན་ཏེ།
en: Similarly, the light and power of my body

source: །དེས་ནི་སེམས་ཅན་གདུལ་དཀའ་ཤིན་ཏུ་འདུལ།
en: Subdue the beings who are difficult to subdue. “My merit is vast and completely pure,

source: །ཁོ་མོའི་བསོད་ནམས་རྣམ་ཡངས་ཡོངས་སུ་དག །ཀུན་ཏུ་རྒྱན་བྱེད་ཟད་པ་མེད་པའི་མཛོད།
en: An inexhaustible treasure completely displayed,

source: །དེས་ནི་རྒྱལ་བ་རྣམས་ལ་མཆོད་པ་བྱེད།
en: Through which offerings are made to the jinas

source: །འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བའང་ཡིན།
en: And all beings are sustained.

source: །ཁོ་མོའི་ཤེས་རབ་རྣམ་ཡངས་ཤིན་ཏུ་དག །དེས་ནི་ཆོས་མང་རྒྱ་མཚོ་རབ་ཏུ་ཤེས།
en: “Vast and completely pure is my wisdom, Through which I know an ocean of Dharma

source: །འགྲོ་བ་ཀུན་གྱི་ཐེ་ཚོམ་ཡོངས་སུ་གཅོད།
en: And cut through the doubts of all beings.

source: །དུས་གསུམ་ཀུན་ལ་ཁོ་མོ་ཞུགས་གྱུར་པས།
en: “Comprehending all three times,

source: །སངས་རྒྱས་རྒྱ་མཚོ་ཀུན་ཀྱང་མཐོང་ཞིང་ཤེས།
en: I see and know an ocean of buddhas

source: །དེ་དག་སྨོན་ལམ་ལ་ཡང་རབ་ཏུ་ཞུགས།
en: And comprehend their prayers.

source: །ཚུལ་འདི་དཔག་ཡས་རབ་ཏུ་རྫོགས་པ་ཡིན།
en: This way is measureless and perfect.

source: །རྡུལ་མང་ཀུན་ལ་ཞིང་རྣམས་རྒྱ་མཚོ་མཐོང་།
en: “I see an ocean of realms within all atoms

source: །དེ་དག་དུས་གསུམ་འཇུག་པ་དེ་བཞིན་ཏེ།
en: And their entry into the three times.

source: །དེ་དག་ཀུན་གྱི་སངས་རྒྱས་རྒྱ་མཚོ་མཐོང་།
en: I see within them an ocean of buddhas

source: །འདི་ནི་ཀུན་ཏུ་གནས་པའི་ཚུལ་གྱིས།
en: And the level of their way that is present everywhere.

source: །རྣམ་པར་སྣང་མཛད་བྱང་ཆུབ་སངས་རྒྱས་ཏེ།
en: “See how the enlightenment, the buddhahood, of Vairocana

source: །ཕྱོགས་རྣམས་ཀུན་གྱི་ཞིང་རྣམས་ཡོངས་བཀང་ཞིང་།
en: Pervades the realms in all directions.

source: །རྡུལ་སྦུབས་ཀུན་གྱི་བྱང་ཆུབ་ཤིང་དྲུང་ན།
en: Within every atom, at the foot of a Bodhi tree,

source: །ཞི་བའི་ཆོས་རྣམས་གསུང་དུ་སྒྲོག་པ་ལྟོས།
en: He is speaking of the Dharma of peace.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ནས། ཇི་སྲིད་ཅིག་ལགས།
en: Then Sudhana, the head merchant’s son, asked Vāsantī, the goddess of the night, “Goddess, how long has it been since you have been established in the highest, complete enlightenment?

source: དེ་ལྟར་ཁྱོད་ཚུལ་འདི་ལྟ་བུས་སེམས་ཅན་གྱི་དོན་བགྱི་བ་ལ་སྟ་གོན་དུ་ཞུགས་པའི་རྣམ་པར་ཐར་པ་དེ་ནི་ཁྱོད་ཀྱིས་བརྙེས་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: How long has it been since you attained this liberation through which you have become established in accomplishing the benefit of beings in this way?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པའི་ཡང་། ཕ་རོལ་ཅིག་ཏུ་བསྐལ་བ་རབ་ཏུ་ཞི་བའི་འོད་ཅེས་བྱ་བ། སངས་རྒྱས་བྱེ་བ་ཕྲག་ལྔ་བརྒྱ་སྐྱེས་པ་བྱུང་སྟེ།
en: Vāsantī, the goddess of the night, answered, “Noble one, beyond and even more beyond as many past kalpas as there are atoms in Sumeru , during a kalpa called Praśantaprabha, there was a world realm called Ratna­śrī­saṃbhava in which there appeared five thousand million buddhas.

source: དེའི་འཇིག་རྟེན་གྱི་ཁམས་ནི་རིན་ཆེན་དཔལ་འབྱུང་ཞེས་བྱ་བར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་དེའི་གླིང་བཞི་པ་འབྲིང་པོ་རིན་ཆེན་ཟླ་བ་སྒྲོན་མའི་འོད་ཅེས་བྱ་བ་དེ་ན། རྒྱལ་པོའི་གནས་པད་མོའི་འོད་ཅེས་བྱ་བ་ཡོད་དེ།
en: Within that world realm there was a medium-sized four-continent world called Ratna­candra­pradīpa­prabhā, the capital of which was called Padmaprabhā

source: རྒྱལ་པོའི་གནས་དེར་རྒྱལ་པོ་ཆོས་རབ་མུ་སྟེགས་ཞེས་བྱ་བ་ཆོས་དང་མཐུན་པའི་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ་གླིང་བཞི་ལ་དབང་བ་རིན་པོ་ཆེ་བདུན་དང་ལྡན་པ་བྱུང་སྟེ།
en: In that capital city there was King Sudharmatīrtha, who was a cakravartin Dharma king who ruled over the four continents and possessed the seven jewels.

source: དེས་ས་ཆེན་པོ་དེ་ཡང་རི་དང་རྒྱ་མཚོར་བཅས་པའི་མཐས་གཏུགས་པར་ཆོས་ཀྱིས་རྒྱས་པར་བྱས་ནས། བདེ་བར་གནས་པར་བྱས་སོ།
en: He spread the Dharma over the mountains and seas of that great world up to its edges and made it happy.

source: །རྒྱལ་པོ་ཆོས་རབ་མུ་སྟེགས་དེའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: King Sudharmatīrtha had a queen named Dharma­mati­candrā.

source: དེ་སྲོད་ལ་འདོད་པས་མྱོས་ཤིང་དགའ་བར་རྩེ་རྩེ་བས་དུབ་ནས་ནམ་གྱི་གུང་ལ་བཙུན་མོའི་འཁོར་གྱི་གནས་སུ་ཕྱིན་ཏེ་ཉལ་ལོ།
en: At dusk, intoxicated by desire and exhausted by bliss, she returned to the harem at midnight and went to sleep.

source: །དེ་ནས་རྒྱལ་པོའི་གནས་པད་མོའི་འོད་དེའི་ཤར་ཕྱོགས་ཀྱི་ནགས་ཚལ་ཆེན་པོ་ཞི་བའི་དཔལ་འབྱུང་བ་ཞེས་བྱ་བར་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྒྱན་ཐམས་ཅད་ཀྱི་འོད་དང་ལྡན་པའི་ལྷུན་ཅན། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བའི་བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོའི་དྲུང་དུ།
en: To the east of the capital city of Padmaprabhā there was a great forest called Śamatha­śrī­sambhava, in which appeared a tathāgata by the name of Sarva­dharma­nigarjita­rāja, whose body shone with the light of all kings of jewels and was the miraculous manifestation of all the buddhas.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ནས།
en: At the foot of a Bodhi tree, he attained the highest, complete enlightenment of buddhahood.

source: དེའི་མཐུས་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་དཔལ་འབྱུང་བ་ཐམས་ཅད་འོད་ཆེན་པོ་ཁ་དོག་ཏུ་མ་ཅན་གྱིས་རྒྱས་ཤིང་སང་བར་གྱུར་ཏོ།
en: Through the power of that, a great light of many colors filled the world realm of Ratna­śrī­saṃbhava.

source: །རྒྱལ་པོའི་གནས་པད་མོའི་འོད་ཅེས་བྱ་བ་དེ་ན་མཚན་མོའི་ལྷ་མོ་ཟླ་བ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་འོད་ཅེས་བྱ་བ་འདུག་འདུག་སྟེ།
en: In the capital city of Padmaprabhā there was a goddess of the night called Suviśuddha­candrābhā.

source: དེས་རྒྱལ་པོའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བའི་གན་དུ་སོང་ནས།
en: She approached Dharma­mati­candrā, the king’s queen, woke her with the sound of rattling her jewelry, and said to her, ‘Know this, queen of the king!

source: རྒྱན་བཀྲོལ་བའི་སྒྲས་སད་པར་བྱས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འདི་ལྟར་རྒྱལ་པོའི་བཙུན་མོ་ཤེས་པར་གྱིས་ཤིག །ནགས་ཚལ་ཆེན་པོ་ཞི་བའི་དཔལ་འབྱུང་བར་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ། །དེ་ནས་དེས་རྒྱལ་པོའི་བཙུན་མོ་དེའི་མདུན་དུ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསྔགས་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་རྒྱ་ཆེར་བཤད་དོ།
en: The Tathāgata Sarva­dharma­nigarjita­rāja has attained the highest, complete enlightenment of buddhahood in the great forest Śamatha­śrī­sambhava.’ Then, in front of the king’s queen she praised the qualities of the buddha and described at length the miraculous manifestations of the buddhas and the completely good conduct and prayer of the bodhisattvas.

source: །རིགས་ཀྱི་བུ་རྒྱལ་པོའི་བཙུན་མོ་དེ་འང་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱིས་སྣང་བར་གྱུར་ཏེ། བསམ་པ་ཐག་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ནས།
en: “Noble one, the king’s queen was illuminated by the light from that tathāgata, and she sincerely entered into the path to the highest, complete enlightenment.

source: དེས་དེ་བཞིན་གཤེགས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དུ་བཅས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་ཆེར་བྱས་སོ།
en: She made offerings to that tathāgata and his saṅgha of bodhisattvas and śrāvakas.

source: །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, noble one?

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་རྒྱལ་པོའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: At that time, in that time, who was that king’s queen, Dharma­mati­candrā?

source: དེ་ལྟར་མི་བལྟ་སྟེ། ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, for at that time, in that time, I was the king’s queen, Dharma­mati­candrā.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་མོས་བའི་སེམས་བསྐྱེད་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བསྐྱེད་བའི་དགེ་བའི་རྩ་བ་དེས། བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཚུན་ཆད་དུ་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མ་སྐྱེས་ཏེ།
en: “Noble one, under that tathāgata I developed the motivation of aspiration and created roots of merit so that for kalpas as numerous as the atoms in Sumeru I never fell into rebirth in the lower realms.

source: སེམས་ཅན་དམྱལ་བར་མ་ཡིན་ནོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་མ་ཡིན། ཡི་དགས་སུ་མ་ཡིན་ནོ།
en: I was never reborn as a denizen of hell, as an animal, or as a preta.

source: །ནམ་ཡང་རིགས་དམའ་བར་མ་སྐྱེས་སོ།
en: I was never reborn in an inferior family.

source: །ནམ་ཡང་དབང་པོ་དང་མི་ལྡན་པར་མ་གྱུར་ཏོ།
en: I was never reborn as someone without sensory faculties.

source: །ནམ་ཡང་སྡུག་བསྔལ་བར་མ་གྱུར་ཏེ།
en: I was never someone who suffered.

source: དེ་ལྟར་ཁོ་མོས་རྟག་པར་ལྷའི་ནང་དུ་ལྷའི་བདག་ཉིད་ཆེ་བ་ཉིད་ཐོབ། མིའི་ནང་དུ་ནི། མིའི་བདག་ཉིད་ཆེ་བ་ཉིད་ཐོབ་སྟེ།
en: I always attained the state of a great deity among deities, and a great human among humans.

source: འདི་ལྟར་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་བཤེས་གཉེན་དང་ཡང་མ་བྲལ་ལོ།
en: In this way, I was never apart from buddhas and bodhisattva kalyāṇamitras.

source: །དུས་ངན་པར་ཡང་མ་སྐྱེས་སོ།
en: I was never reborn in a bad time.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་ལམ་བདེ་ཞིང་མཉམ་པ་ནས་ཉེ་ཞོ་མེད་པར་ཕྱིན་ཀྱང་དེ་ཙམ་གྱིས་ཁོ་མོའི་བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ཡོངས་སུ་གྲུབ་པར་མ་གྱུར་ཏེ། རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པ་དེ་དག་ནི་འདས།
en: “Noble one, in that way, I created roots of merit under one buddha after another, and for as many kalpas as there are atoms in Sumeru , I traveled on easy and level paths without any impediment, but I had not yet accomplished the powers of a bodhisattva.

source: བསྐལ་པ་བཟང་པོ་འདིའི་སྔ་རོལ་གྱི་ནི་བསྐལ་པ་ཆེན་པོ་སྟོང་ཕྲག་བཅུའི་ཐོག་མ་ལ་བབ་པ་དེའི་ཚེ། འཇིག་རྟེན་གྱི་ཁམས་གཟི་བརྗིད་རྡུལ་གྱི་དྲི་མ་མྱེད་པ་ཞེས་བྱ་བར། བསྐལ་པ་མྱ་ངན་མེད་ཅིང་། རྡུལ་དང་བྲལ་བ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: When those kalpas as numerous as the atoms in Sumeru had passed, ten thousand great kalpas before this Bhadra kalpa, at the time of the first of those kalpas, which was called Aśokaviraja, there was a world realm called Rajovimala­tejaḥśrī.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་གཟི་བརྗིད་རྡུལ་གྱི་དྲི་མ་མེད་པའི་དཔལ་དེ་ནི། ཀུན་ནས་ཉོན་མོངས་ལ་རྣམ་པར་དག་པར་གྱུར་ཏེ། དེར་སངས་རྒྱས་ལྔ་བརྒྱ་བྱུང་ངོ་།
en: “Noble one, that world realm Rajovimala­tejaḥśrī was completely pure of the kleśas, and five hundred buddhas appeared within it.

source: །སངས་རྒྱས་ལྔ་བརྒྱ་པོ་དེ་དག་གི་ཐོག་མ་ལ་དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རི་རབ་རྒྱལ་མཚན་སྤྱན་ཡངས་ཤིང་ཞི་བའི་དཔལ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: The first of those five hundred buddhas was a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, who was named Sumeru­dhvajāyatana­śānta­netra­śrī.

source: དེའི་ཚེ་ཁོ་མོ་ཡང་ཚོང་དཔོན་སྙན་པ་རྣམ་པར་གྲགས་པའི་བུ་མོ་ཤེས་རབ་སྣང་བའི་དཔལ་ཞེས་བྱ་བ།
en: At that time, I was Prajñāvabhāsa­śrī, the daughter of the head merchant Vighuṣṭakīrti.

source: གཟུགས་མཛེས་ཤིང་བཟང་ལ་བལྟ་ན་སྡུག་པ་ཁ་དོག་ཤིན་ཏུ་མཛེས་ཤིང་རྒྱས་པ་དང་ལྡན་པ་ཞིག་ཏུ་གྱུར་ཏེ།
en: I was beautiful and attractive, a delight to see, with a very beautiful, perfect complexion.

source: མཚན་མོའི་ལྷ་མོ་ཟླ་བ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་འོད་ཅེས་བྱ་བ་དེ་ཡང་། སྨོན་ལམ་གྱི་དབང་གིས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་དང་བྲལ་བའི་རྒྱལ་པོའི་གནས་རྒྱལ་མཚན་སྣ་ཚོགས་སུ་མཚན་མོའི་ལྷ་མོ་མིག་རྣམ་པར་དག་པ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: “The goddess of the night called Suviśuddha­candrābhā, through the power of her prayers, had become the goddess of the night called Viśuddha­netrābhā in Vicitra­dhvaja, the capital of the four-continent world realm named Virajovatī.

source: དེས་ཁོ་མོ་མཚན་མོ་མི་ཉལ་ཙམ་ཞིག་ན། ཕ་མ་ཉལ་བར་གྱུར་པ་དང་། ཁྱིམ་དེ་ཡང་ཡོངས་སུ་བསྐྱོད་དེ་འོད་ཆེན་པོས་སྣང་བར་བྱས་ནས་རང་གི་གཟུགས་བསྟན་ཏེ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསྔགས་པ་བརྗོད་ནས།
en: At night, while I was not yet asleep and my parents were asleep, she shook our house, illuminated it with a great light, revealed her own form to me, and praised the qualities of the buddhas.
